[
    {
        "name": "Day6",
        "company": {
            "name": "JYP Entertainmemt",
            "latitude": 37.5241,
            "longitude": 127.1291
        },
        "description": "Day6 (Korean: 데이식스; RR: De-i-sik-seu; stylized in all caps) is a South Korean pop rock band under the label JYP Entertainment. The group debuted on September 7, 2015, with the EP The Day, which peaked at No.2 on Billboard's World Album Chart a week following its release. The band consists of four members: Sungjin, Young K, Wonpil and Dowoon. Originally a six-piece band, Junhyeok departed on February 27, 2016, and Jae departed on December 31, 2021. All of the Day6 members are heavily involved in writing, composing and producing the band's music.\r\n\r\nIn 2017, the band released two songs every month of the year for their Every Day6 project. By the end of the project, 25 songs were added to their discography, with genres ranging from hard rock and upbeat sing-a-longs to mellow ballads. Their first full-length album, Sunrise, consisted of songs released in the first half of the Every Day6 project. It was number 14 on Billboard's The 25 Greatest K-Pop Albums of the 2010s: Staff List, and the project kick-off song \"I Wait\" was placed No.81 on Billboard's The 100 Greatest K-Pop Songs of the 2010s: Staff List.",
        "iconName": "day6-icon",
        "favStatus": true,
        "sns": [
            {
                "text": "Twitter: @day6official",
                "link": "https://twitter.com/day6official"
            }
        ]
    },
    {
        "name": "Dreamcatcher",
        "company": {
            "name": "Dreamcatcher Company",
            "latitude": 37.514414,
            "longitude": 127.053344
        },
        "description": "Dreamcatcher (Korean: 드림캐쳐, romanized: deurimkaechyeo; formerly known as MINX; also stylized as Dream Catcher) is a South Korean girl group formed by Happyface Entertainment (now Dreamcatcher Company). The group consists of seven members: JiU, SuA, Siyeon, Handong, Yoohyeon, Dami and Gahyeon. They made their official debut on January 13, 2017, with the single album Nightmare.\r\n\r\nDreamcatcher originally debuted under the name MINX with a five-member line-up of JiU, SuA, Siyeon, Yoohyeon, and Dami. In November 2016, the group announced that they would re-debut in 2017 under the new name Dreamcatcher, with two new members Handong and Gahyeon, as well as a darker concept with a non-mainstream music style to stand out from other K-pop girl groups.\r\n\r\nDreamcatcher has come to be known as \"The Face of Rock in K-pop\" and their music has been praised for its distinctive sound with elements of rock and metal. The group has developed a stronger international rather than domestic popularity and a reputation for touring overseas often.",
        "iconName": "dreamcatcher-icon",
        "favStatus": true,
        "sns": [
            {
                "text": "Twitter: @hf_dreamcatcher",
                "link": "https://twitter.com/hf_dreamcatcher"
            },
            {
                "text": "Twitter: @DC_FANSTAFF",
                "link": "https://twitter.com/DC_FANSTAFF"
            }
        ]
    },
    {
        "name": "Kang Daniel",
        "company": {
            "name": "Konnect Entertainment",
            "latitude": 37.524264,
            "longitude": 127.032247
        },
        "description": "Kang Daniel (Korean: 강다니엘; commonly stylized as KANGDANIEL; born Kang Eui-geon [강의건]; December 10, 1996) is a South Korean singer-songwriter, actor, television host, and businessman who rose to fame in early 2017 as the first-place winner of the second season of reality competition series Produce 101. He is a former member of the show's resulting boy group Wanna One that, at the time, was a major power player in the K-pop industry.\r\n\r\nFollowing the end of Wanna One's activities as a group, Kang took a six-month hiatus from the entertainment industry and took over management of his career. In mid-2019, he released his solo debut extended play (EP), Color on Me, which was a commercial success that topped South Korea's Gaon Album Chart. His subsequent works from his color series titled Cyan (2020) and Magenta (2020) also topped the Gaon Album Chart with the former's title track earning Kang his first domestic top ten single. Further solidifying his career as a solo artist, Kang earned his first top five single in Korea as well as his first solo appearance on Billboard's World Digital Song Sales chart through the single \"Paranoia\". He then released the third and final chapter of his \"color trilogy\", Yellow (2021), which topped the Gaon Album Chart and contained his first domestic number one single titled \"Antidote\".\r\n\r\nAlongside his music career, Kang appeared as the host of Mnet's Street Woman Fighter (2021), the spin-off show Street Dance Girls Fighter (2021–2022), and the sequel Street Man Fighter (2022) in addition to the one-episode television special titled Be the SMF (2022) that preceded it. He also made his acting debut through the first-ever Korean Disney+ Star original series, Rookie Cops (2022). His other ventures include establishing an independent entertainment company named Konnect Entertainment to manage his own career that has since expanded to manage other artists in addition to himself.\r\n\r\nKang is the recipient of numerous accolades including four Seoul Music Awards, one Melon Music Award, one Circle Chart Music Award, and a Guinness World Record. His acting debut also earned him various accolades including two Asia Artist Awards, one Blue Dragon Series Award, and a Seoul International Drama Award. He has made the Gallup Korea list of Most Preferred Idols in 2017, 2018, and 2019, the Forbes Korea Power Celebrity 40 list in 2019 and 2022, and appeared on People's list of talented emerging artists making their mark in 2022. In the same year, Kang was the recipient of the Seoul Mayor's Award for Culture due to his great contribution to the rise of Seoul's awareness by promoting Hallyu (the Korean Wave) in various fields.",
        "iconName": "kang-daniel-icon",
        "favStatus": true,
        "sns": [
            {
                "text": "Twitter: @konnect_danielk",
                "link": "https://twitter.com/konnect_danielk"
            },
            {
                "text": "Twitter: @Kangdaniel_jp",
                "link": "https://twitter.com/Kangdaniel_jp"
            },
            {
                "text": "Twitter: @danielk_staff",
                "link": "https://twitter.com/danielk_staff"
            }
        ]
    },
    {
        "name": "Onewe",
        "company": {
            "name": "RBW Entertainment",
            "latitude": 37.568899,
            "longitude": 127.070346
        },
        "description": "Onewe (Korean: 원위, stylized in all caps, pronounced [wʌnˌwi]) is a South Korean alternative rock band composed of five members: Yonghoon, Harin, Kanghyun, Dongmyeong and Giuk (formerly known as CyA). The members originally formed under the name M.A.S 0094 (Make a Sound 0094). They released their first digital single \"Butterfly, Find a Flower\" on August 13, 2015 under Modern Music. In April 2017, they moved to RBW and were renamed MAS. In June 2018, it was announced that the band would redebut under the new band name, Onewe. The band officially made its re-debut on May 13, 2019 with their first single album 1/4.",
        "iconName": "onewe-icon",
        "favStatus": true,
        "sns": [
            {
                "text": "Twitter: @official_ONEWE",
                "link": "https://twitter.com/official_ONEWE"
            },
            {
                "text": "Twitter: @ONEWE_JPN",
                "link": "https://twitter.com/ONEWE_JPN"
            }
        ]
    },
    {
        "name": "STAYC",
        "company": {
            "name": "High Up Entertainment",
            "latitude": 37.558581,
            "longitude": 126.918511
        },
        "description": "STAYC (/ˈsteɪsi/; Korean: 스테이씨; RR: Seuteissi, acronym for Star to a Young Culture) is a South Korean girl group formed by High Up Entertainment. The group is composed of six members: Sumin, Sieun, Isa, Seeun, Yoon, and J. They debuted on November 12, 2020, with the release of their debut single album Star to a Young Culture.",
        "iconName": "stayc-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @STAYC_official",
                "link": "https://twitter.com/STAYC_official"
            },
            {
                "text": "Twitter: @STAYC_JP",
                "link": "https://twitter.com/STAYC_JPN"
            },
            {
                "text": "Twitter: @STAYC_talk",
                "link": "https://twitter.com/STAYC_talk"
            }
        ]
    },
    {
        "name": "Oh My Girl",
        "company": {
            "name": "WM Entertainment",
            "latitude": 37.556597,
            "longitude": 126.908856
        },
        "description": "Oh My Girl (Korean: 오마이걸; RR: Omaigeol, stylized in all caps or OMG) is a South Korean girl group formed by WM Entertainment. The group is composed of six members: Hyojung, Mimi, YooA, Seunghee, Yubin and Arin. Originally an eight-piece group, JinE left the group in October 2017 due to health issues, and Jiho left in May 2022. Oh My Girl debuted on April 20, 2015, with an eponymous extended play.",
        "iconName": "oh-my-girl-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @8_OHMYGIRL",
                "link": "https://twitter.com/8_OHMYGIRL"
            },
            {
                "text": "Twitter: @OHMYGIRLJAPAN",
                "link": "https://twitter.com/OHMYGIRLJAPAN"
            },
            {
                "text": "Twitter: @WM_OHMYGIRL",
                "link": "https://twitter.com/WM_OHMYGIRL"
            }
        ]
    },
    {
        "name": "The Boyz",
        "company": {
            "name": "IST Entertainment",
            "latitude": 37.527656,
            "longitude": 127.034458
        },
        "description": "The Boyz (Korean: 더보이즈) is a South Korean boy band formed and managed by IST Entertainment. The group debuted on December 6, 2017, with the lead single \"Boy\" from their debut EP The First. The group is composed of Sangyeon, Jacob, Younghoon, Hyunjae, Juyeon, Kevin, New, Q, Ju Haknyeon, Sunwoo and Eric, and previously Hwall until his departure from the group in October 2019.",
        "iconName": "the-boyz-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @IST_THEBOYZ",
                "link": "https://twitter.com/IST_THEBOYZ"
            },
            {
                "text": "Twitter: @THEBOYZJAPAN",
                "link": "https://twitter.com/THEBOYZJAPAN"
            },
            {
                "text": "Twitter: @WE_THE_BOYZ",
                "link": "https://twitter.com/WE_THE_BOYZ"
            }
        ]
    },
    {
        "name": "ATEEZ",
        "company": {
            "name": "KQ Entertainment",
            "latitude": 37.558284,
            "longitude": 126.921143
        },
        "description": "Ateez (Korean: 에이티즈; RR: Eitijeu, stylized in all caps) is a South Korean boy band formed by KQ Entertainment. The group consists of eight members: Hongjoong, Seonghwa, Yunho, Yeosang, San, Mingi, Wooyoung and Jongho. They debuted on October 24, 2018, with the extended play (EP) Treasure EP.1: All to Zero.\r\n\r\nAs of June 2023, Ateez have released ten EPs, one studio album and one single album in the Korean language, as well as two single albums, three EPs and two studio albums in the Japanese language. Treasure EP.Fin: All to Action, Treasure Epilogue: Action to Answer, Zero: Fever Part.1, Zero: Fever Part.2, Zero: Fever Epilogue, The World EP.1: Movement and The World EP.2: Outlaw each topped the South Korean Gaon Album Chart, with Zero: Fever Part. 1 becoming the group's first to be certified platinum in the country.\r\n\r\nOften referred to as \"Global Performance Idols\" by Korean media and dubbed \"4th Generation Leaders\" by the Korean Ministry of Culture, Sports, and Tourism, Ateez have sold over four million physical albums worldwide. Their accolades include Worldwide Fans' Choice at the 2019 and 2020 Mnet Asian Music Awards and bonsang awards (main prize) at the 4th Fact Music Awards and the 30th and 31st Seoul Music Awards. The group has also served as official global ambassadors for Korean culture and tourism.",
        "iconName": "ateez-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @ATEEZofficial",
                "link": "https://twitter.com/ATEEZofficial"
            },
            {
                "text": "Twitter: @ATEEZofficialjp",
                "link": "https://twitter.com/ATEEZofficialjp"
            },
            {
                "text": "Twitter: @ATEEZstaff",
                "link": "https://twitter.com/ATEEZstaff"
            }
        ]
    },
    {
        "name": "BDC",
        "company": {
            "name": "BrandNew Music Entertainment",
            "latitude": 37.485804,
            "longitude": 126.995342
        },
        "description": "BDC (Korean: 비디씨, acronym for Boys Da Capo) is a South Korean trio formed by Brand New Music in 2019. The triplet consist of members Kim Si-hun, Hong Seong-jun, and Yun Jung-hwan. The group debuted on October 29, 2019, with the single album Boys Da Capo.",
        "iconName": "bdc-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @BDC_BNM",
                "link": "https://twitter.com/BDC_BNM"
            },
            {
                "text": "Twitter: @BDC_JAPAN",
                "link": "https://twitter.com/BDC_JAPAN"
            }
        ]
    },
    {
        "name": "F.T. Island",
        "company": {
            "name": "FNC Entertainment",
            "latitude": 37.527522,
            "longitude": 127.049986
        },
        "description": "F.T. Island (Korean: 에프티 아일랜드, or FT아일랜드, short for Five Treasure Island), is a South Korean rock band formed by FNC Entertainment in 2007. The band currently consists of main vocalist Lee Hong-gi, bassist Lee Jae-jin, and drummer Choi Min-hwan. Guitarist Oh Won-bin left the band in 2009 and was replaced by Song Seung-hyun. Former leader Choi Jong-hoon left the band and retired from the entertainment industry on March 14, 2019, while Seung-hyun left the group on December 31, 2019, to pursue his acting career.\r\n\r\nF.T. Island debuted on the music television program M! Countdown on June 7, 2007, with the single \"Love Sick\". Their debut studio album, Cheerful Sensibility, was the sixth best-selling of the year and \"Love Sick\" topped the K-pop charts for eight consecutive weeks. Later that year, the band won the Best New Male Group at the Mnet Asian Music Awards and the Popularity and Rookie of the Year awards at the Golden Disk Awards.\r\n\r\nF.T. Island made their Japanese debut on June 8, 2008, with the extended play Prologue of F.T. Island: Soyogi. The band started getting recognition in the country following the release of their third Japanese studio album, Five Treasure Island, in 2011, which topped the Oricon Albums Chart and spawned the single \"Flower Rock\". Additionally, F.T. Island is the first foreign male band and the first band in 42 years to top the Oricon Daily Charts.\r\n\r\nF.T. Island's most well-known songs include \"After Love\", \"Bad Woman\", \"I Hope\", \"Hello Hello\", \"Severely\", \"I Wish\", and the chart-toppers \"Love Sick\", \"Thunder\", \"Until You Come Back\", and \"Love Love Love\". Considered to be South Korea's first idol band, F.T. Island paved the way for such acts, including label mate N.Flying.",
        "iconName": "ftisland-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @FT_FANCLUB",
                "link": "https://twitter.com/FT_FANCLUB"
            },
            {
                "text": "Twitter: @ftisland_japan",
                "link": "https://twitter.com/ftisland_japan"
            }
        ]
    },
    {
        "name": "CNBLUE",
        "company": {
            "name": "FNC Entertainment",
            "latitude": 37.527522,
            "longitude": 127.049986
        },
        "description": "CNBLUE (Korean: 씨엔블루) is a South Korean pop rock band formed in 2009. The band consists of Jung Yong-hwa (leader, main vocals, guitar, keyboard, rap), Kang Min-hyuk (drums), and Lee Jung-shin (bass). First bassist Kwon Kwang-jin left the band after they released their debut Japanese extended play Now or Never in 2009, and was replaced by Lee Jung-shin. Lee Jong-hyun (guitar and vocals) left the band on August 28, 2019.\r\n\r\nCN is an initialism for Code Name, while BLUE is a backronym for burning, lovely, untouchable, and emotional; it is meant to portray the images of Jong-hyun, Min-hyuk, Jung-shin, and Yong-hwa, respectively. On January 14, 2010, CNBLUE debuted in Korea with the lead single \"I'm a Loner\" from their first Korean EP Bluetory.",
        "iconName": "cnblue-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @official_CNBLUE",
                "link": "https://twitter.com/official_CNBLUE"
            },
            {
                "text": "Twitter: @CN_FANCLUB",
                "link": "https://twitter.com/CN_FANCLUB"
            },
            {
                "text": "Twitter: @cnblue_japan",
                "link": "https://twitter.com/cnblue_japan"
            }
        ]
    },
    {
        "name": "N.Flying",
        "company": {
            "name": "FNC Entertainment",
            "latitude": 37.527522,
            "longitude": 127.049986
        },
        "description": "N.Flying (Korean: 엔플라잉, Japanese: エヌフライング; short for New Flying which also means 'new wings' or 'new escape') is a South Korean rap rock band formed by FNC Entertainment in 2013. The group released its first digital indie single \"Basket\" in Japan on October 1, 2013, with the four-member line-up of Kwon Kwang-jin, Lee Seung-hyub, Cha Hun and Kim Jae-hyun. The group officially debuted in Korea on May 20, 2015, with the EP Awesome. A fifth member, Yoo Hwe-seung was added to the band in June 2017. Kwang-jin left the group on December 26, 2018, and was replaced by Seo Dong-sung on January 1, 2020.",
        "iconName": "nflying-icon",
        "favStatus": false,
        "sns": [
            {
                "text": "Twitter: @NFlyingofficial",
                "link": "https://twitter.com/NFlyingofficial"
            },
            {
                "text": "Twitter: @NF_official_jp",
                "link": "https://twitter.com/NF_official_jp"
            }
        ]
    }
]
